emacs/.emacs.d/config.org
#+TITLE: An Emacs Configuration
#+AUTHOR: Khinshan Khan
#+PROPERTY: header-args :tangle init.el
#+STARTUP: showall
#+PRIORITIES: A D B

Another emacs config being version controlled. This one's just for me, but feel free to learn from/ use it.

* TODO Preface

* License

  This configuration is a part of my dotfiles, so the license is MIT as found [[file:./../../LICENSE.org][here]].

* Pre-Configuration

  This code should be executed first. It's general, but will make the rest of the configuration nicer since it's
  somewhat 'meta'.

** Initialization

   Add [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Lexical-Binding.html][lexical binding]] support globally.

   #+begin_src emacs-lisp
;; -*- lexical-binding: t -*-
   #+end_src

** Garbage Collection

   We don't need [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Garbage-Collection.html][garbage collection]] so low (maybe on a machine from a couple decade ago...) nor does =load-file= need the
   [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Magic-File-Names.html][file name handler]] during start up. We'll reset it afterwards.

   #+begin_src emacs-lisp
(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.6
      last-file-name-handler-alist file-name-handler-alist
      file-name-handler-alist nil)

(defun shan|revert-gc ()
  "Reset values and garbage collect."
  (setq gc-cons-threshold 16777216
        gc-cons-percentage 0.1
        file-name-handler-alist (append last-file-name-handler-alist
                                        file-name-handler-alist))
  (cl-delete-duplicates file-name-handler-alist :test 'equal)
  (makunbound 'last-file-name-handler-alist)
  (garbage-collect))

(add-hook 'after-init-hook 'shan|revert-gc)
   #+end_src

* Package Setup

** Path to this File

   #+begin_src emacs-lisp
(defconst shan--config-dir (file-name-directory (file-chase-links load-file-name))
  "Directory where this file exists. Useful for generality in case of `load' or different paths.")
   #+end_src

** Package Installer

   Straight is currently the best and feature rich/ flexible package manager.

   #+begin_src emacs-lisp
(setq package-enable-at-startup nil
      straight-use-package-by-default t
      straight-recipe-repositories nil
      straight-repository-branch "master"
      straight-fix-org nil)

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;; TODO: I still have some stray demands in my config, should figure that out sometime
(setq-default use-package-always-defer nil
	      use-package-always-demand t
	      byte-compile-warnings nil)
;; (setq use-package-verbose t)

(straight-use-package 'use-package)
   #+end_src

** TODO Package Paths

   Load this before any other third-party packages to keep init directory clean.

   #+begin_src emacs-lisp
(use-package no-littering
  :init
  (require 'no-littering))
   #+end_src

** Shell Paths

   #+begin_src emacs-lisp
(use-package exec-path-from-shell
  :init
  (exec-path-from-shell-initialize))
   #+end_src

* Tricks n Gimmicks for Sweeter Configuration

  General nice configuration to have. It'll help with later in the config.

** Helpful Libraries

   These are just cool libraries I’d like to use during my configuration, or many of the packages use them.

   #+begin_src emacs-lisp
(use-package dash-functional
  :demand t)
(use-package f
  :demand t)
(use-package s
  :demand t)
(use-package string-inflection
  :demand t)

(require 'loadhist)
(require 'cl-seq)
   #+end_src

** Personal Variables

   Me, myself, and I. These are personal preferences for emacs file structure.

   I keep a second repository which hosts a lot of private config (just api keys and login info, no featues per se).

   #+begin_src emacs-lisp
(defconst custom-file (concat user-emacs-directory "custom.el"))
(defconst shan--settings-path (concat user-emacs-directory "personal/settings.el")
  "Path to personal settings meant not be public (api keys and stuff).")
(defconst shan--settings-exist? (file-exists-p shan--settings-path)
  "Checks if shan--settings-path exists.")

(if shan--settings-exist?
    (load-file shan--settings-path)
  (message "Settings file not found!"))
   #+end_src

