emacs/.emacs.d/config.org
** Backups

   I don't particularly need backup files, and =~= + =#= files are a pain to clean anyways.

   #+begin_src emacs-lisp
(setq-default backup-inhibited t
              auto-save-default nil
              create-lockfiles nil
              make-backup-files nil)
   #+end_src

* Appearance

** GUI

   You need to experience keyboard to realize keyboard master race. (=fn + f10= if need be for options though)

   #+begin_src emacs-lisp
(setq inhibit-startup-message t)
(dolist (fn '(tool-bar-mode scroll-bar-mode menu-bar-mode))
  (if (fboundp fn)
      (funcall fn -1)))
   #+end_src

** Font

   Source code pro is good just the way it is. Noto just seems to break emacs(?). Symbola for emoji!

   #+begin_src emacs-lisp
(when (member "Source Code Pro" (font-family-list))
  (set-face-attribute 'default nil
                      :family "Source Code Pro"
                      :weight 'normal
                      :width 'normal))

(add-to-list 'face-ignored-fonts "Noto Color Emoji")

(when (member "Symbola" (font-family-list))
  (set-fontset-font t 'unicode "Symbola" nil 'prepend))
   #+end_src

** Theme

   Doom themes are best esp since I use Doom modeline. Also, Doom Dracula just has better keyword support as far as I’ve seen. It’s also just easy on my eyes.

   #+begin_src emacs-lisp
(use-package doom-themes
  :demand t
  :config
  (setq doom-vibrant-brighter-comments t
        doom-vibrant-brighter-modeline t)
  (doom-themes-org-config)
  (load-theme 'doom-dracula t))
   #+end_src

   The dark nights sometimes need a little sun. The slight brightness is nice for the eyes.

   #+begin_src emacs-lisp
(use-package solaire-mode
  :demand t
  :functions persp-load-state-from-file
  :hook
  (prog-mode . turn-on-solaire-mode)
  (minibuffer-setup . solaire-mode-in-minibuffer)
  (after-load-theme . solaire-mode-swap-bg)
  :config
  (setq solaire-mode-remap-modeline nil
        solaire-mode-remap-fringe nil)
  (solaire-global-mode 1)
  (solaire-mode-swap-bg)
  (advice-add #'persp-load-state-from-file
              :after #'solaire-mode-restore-persp-mode-buffers))
   #+end_src

** Modeline

   Definitely needed, or else you’d never know where you are.

   #+begin_src emacs-lisp
(dolist (fn '(line-number-mode column-number-mode))
  (if (fboundp fn)
      (funcall fn t)))
   #+end_src

   The cleanest modeline I’ve ever used.

   #+begin_src emacs-lisp
(use-package doom-modeline
  :demand t
  :config
  (setq doom-modeline-python-executable "python3"
        doom-modeline-icon t
        doom-modeline-major-mode-icon t
        doom-modeline-version t
        doom-modeline-buffer-file-name-style 'file-name)
  (doom-modeline-mode))
   #+end_src

** Zoom

*** TODO Font Size Zooming

    Increases the font in all buffers, great for when I have to use external monitors or present. A bit buggy...

    #+begin_src emacs-lisp
(use-package default-text-scale
  :init
  (default-text-scale-mode))
    #+end_src

*** Single Window Focus Zooming

    Useful for zero-ing in on a file for a bit, but keeping the rest of the setup.

    #+begin_src emacs-lisp
(use-package zoom-window
  :bind
  ("C-z" . zoom-window-zoom)
  :config
  (setq zoom-window-mode-line-color "#412170"))
    #+end_src

** Interface

*** Bells

    Okay, these bells are annoying. They're not even useful half the time.

    #+begin_src emacs-lisp
(setq-default visible-bell nil
              audible-bell nil
              ring-bell-function 'ignore)
    #+end_src

*** Confirmation Messages

    Who types a whole =yes= intead of =y= nowadays..?

    #+begin_src emacs-lisp
(defalias 'yes-or-no-p (lambda (&rest _) t))
(setq-default confirm-kill-emacs nil)
(setq save-abbrevs t)
(setq-default abbrev-mode t)
(setq save-abbrevs 'silently)
    #+end_src

*** TODO Scratch Buffer

    I like my scratch buffers to be lisp and empty, thought I could always use =M-x language-mode= to change the
    language. It's pretty useful for quick tests, though org mode is becoming increasingly easier to use, may change
    initial scratch mode to that. Perhaps I should make a function to spawn a scratch buffer using the mode I'm in?

    #+begin_src emacs-lisp
(setq-default initial-major-mode 'lisp-interaction-mode)
(setq initial-scratch-message nil)
    #+end_src

** UI

   Heavy motivation from Doom Emacs

*** Cursor

    #+begin_src emacs-lisp
(when (fboundp 'blink-cursor-mode)
  (blink-cursor-mode 0))

(setq-default blink-matching-paren nil
              visible-cursor nil
              x-stretch-cursor nil
              cursor-type 'box)
    #+end_src

    TODO: Need to get to cutomizing [[https://github.com/Malabarba/beacon][this]] later.

    #+begin_src emacs-lisp
(use-package beacon
  :hook
  (focus-in . beacon-blink)
  :config
  (beacon-mode))
    #+end_src

* General Editing

  These guys are almost always active and a series of small things that have become second nature by now.

  #+begin_src emacs-lisp
(use-package rainbow-delimiters
  :hook
  (prog-mode . rainbow-delimiters-mode))

(use-package smartparens
  :hook
  (prog-mode . smartparens-mode)
  :custom
  (sp-escape-quotes-after-insert nil)
  :config
  (require 'smartparens-config))

(use-package paren
  :demand t
  :config
  (setq show-paren-when-point-in-periphery t
        show-paren-when-point-inside-paren t)
  (show-paren-mode t))

(use-package move-text
  :config
  (move-text-default-bindings))
  #+end_src

  Lifted the overlay code from Centaur Emacs (gives priority to rainbow mode). The rest makes the minor mode global so
  it's active all the time... but global rainbow may be bad for big or messy files, so watch out!

  #+begin_src emacs-lisp
(use-package rainbow-mode
  :config
  (with-no-warnings
    ;; HACK: Use overlay instead of text properties to override `hl-line' faces.
    ;; @see https://emacs.stackexchange.com/questions/36420
    (defun my-rainbow-colorize-match (color &optional match)
      (let* ((match (or match 0))
             (ov (make-overlay (match-beginning match) (match-end match))))
        (overlay-put ov 'ovrainbow t)
        (overlay-put ov 'face `((:foreground ,(if (> 0.5 (rainbow-x-color-luminance color))
                                                  "white" "black"))
                                (:background ,color)))))
    (advice-add #'rainbow-colorize-match :override #'my-rainbow-colorize-match)

    (defun my-rainbow-clear-overlays ()
      "Clear all rainbow overlays."
      (remove-overlays (point-min) (point-max) 'ovrainbow t))
    (advice-add #'rainbow-turn-off :after #'my-rainbow-clear-overlays))

  (define-globalized-minor-mode global-rainbow-mode rainbow-mode
    (lambda () (rainbow-mode 1)))
  (global-rainbow-mode 1))
  #+end_src

  I know what I'm doing, no need to hide these functions from me.

  #+begin_src emacs-lisp
(put 'upcase-region 'disabled nil)
(put 'downcase-region 'disabled nil)
(put 'narrow-to-region 'disabled nil)
  #+end_src

  Some sensible defaults, mostly from the titular [[https://github.com/hrs/sensible-defaults.el][repo]] (a lot of it merged into Emacs though... so just some
  re-bindings). Rest is all me and what I find sane.

  #+begin_src emacs-lisp
(use-package expand-region
  :bind
  ("C-=" . er/expand-region))

(defun shan/fill-or-unfill ()
  "Fill or unfill based on the previous command."
  (interactive)
  (let ((fill-column
         (if (eq last-command 'endless/fill-or-unfill)
             (progn (setq this-command nil)
                    (point-max))
           fill-column)))
    (call-interactively #'fill-paragraph)))

(setq-default require-final-newline t
              vc-follow-symlinks t)

(global-subword-mode t)
(delete-selection-mode t)
(global-font-lock-mode t)
(add-hook 'before-save-hook #'delete-trailing-whitespace)

(global-set-key [remap fill-paragraph]
                #'shan/fill-or-unfill)

(global-set-key (kbd "M-;")
                'comment-line)
  #+end_src

* Bindings

** Which Key

   Display available keybindings in a popup.

   #+begin_src emacs-lisp
(use-package which-key
  :init
  (which-key-mode 1))
;; :bind
;; ("C-h m" . which-key-show-major-mode)
;; ("C-h b" . which-key-show-top-level)
   #+end_src

** TODO Multiple Cursors

   #+begin_src emacs-lisp
(use-package multiple-cursors
  :config
  (global-set-key (kbd "C-S-p") 'mc/mark-previous-like-this)
  (global-set-key (kbd "C-S-n") 'mc/mark-next-like-this)
  (global-set-key (kbd "C-x r t") 'mc/edit-lines)
  (global-set-key (kbd "C-S-<mouse-1>") 'mc/add-cursor-on-click)
  (define-key mc/keymap (kbd "<return>") nil))
   #+end_src

*** Key Chords

    #+begin_src emacs-lisp
(use-package key-chord
  :demand t
  :config
  (setq key-chord-two-keys-delay 0.05)
  (key-chord-mode t))

(use-package use-package-chords
  :demand t)
    #+end_src

* Hydra

  Important to take note of the following chart when making hydras:

  |------------+-----------------------+-----------------------+-----------------|
  | Body Color | Head  Inherited Color | Executing NON-HEADS   | Executing HEADS |
  |------------+-----------------------+-----------------------+-----------------|
  | amaranth   | red                   | Disallow and Continue | Continue        |
  | teal       | blue                  | Disallow and Continue | Quit            |
  | pink       | red                   | Allow and Continue    | Continue        |
  | red        | red                   | Allow and Quit        | Continue        |
  | blue       | blue                  | Allow and Quit        | Quit            |
  |------------+-----------------------+-----------------------+-----------------|

  #+begin_src emacs-lisp
(use-package hydra
  :demand t
  :config
  (setq hydra--work-around-dedicated nil
        hydra-is-helpful t
        hydra-hint-display-type 'lv
        lv-use-separator nil)
  :chords
  ("ao" . hydra-leader/body))

(use-package pretty-hydra
  :demand t)
  #+end_src

** Hydra Maps

   I feel like pink hydras are the way to go, since I enjoy being about to use continuous undo or highlighting for a
   region based hydra command. But, feel free to change as you see fit.

