emacs/.emacs.d/config.org
*** LSP Hydra

    #+begin_src emacs-lisp
(pretty-hydra-define hydra-lsp (:exit t :color pink :title " LSP" :quit-key "q")
  ("Find"
   (("." lsp-ui-peek-find-references "find references")
    ("d" lsp-find-definition "find definition")
    ("t" lsp-find-type-definition "find type definition"))
   "Refactor"
   (("e" lsp-rename "rename symbol at point")
    ("f" lsp-format-buffer "format buffer"))
   "Show"
   (("j" lsp-ui-imenu "symbol table")
    ("l" lsp-ui-flycheck-list "error list"))
   " Exit"
   (("DEL" hydra-leader/body (propertize "+leader" 'face 'bold)))))
    #+end_src

* Version Control

** General Git

   #+begin_src emacs-lisp
(use-package gitattributes-mode)
(use-package gitignore-mode)
(use-package gitconfig-mode)
   #+end_src

** Magit

   Some people download emacs just for magit, it'd be crazy to not use it for vc.

   #+begin_src emacs-lisp
(use-package magit
  :defer t
  :bind
  (:map magit-status-mode-map
        ("q" . (lambda () (interactive) (magit-mode-bury-buffer 16))))
  :config
  ;; allow window to be split vertically rather than horizontally
  (setq split-width-threshold 0)
  (setq split-height-threshold nil)
  ;; full window magit
  (setq magit-display-buffer-function 'magit-display-buffer-fullframe-status-v1))
   #+end_src

   #+begin_src emacs-lisp
(use-package transient
  :defer t
  :config
  (transient-bind-q-to-quit))
   #+end_src

** TODO Forge

   Not currently using, but could be powerful in the future. (Should look into gh cli tool)

   #+begin_src emacs-lisp :tangle off
(use-package forge)
   #+end_src

* Programming Environment

** Auto IDE

   Add an hydra to a list, based on a mode, which then gets resolved by =shan--ide-resolve=.

   #+begin_src emacs-lisp
(defvar shan--ide-alist '()
  "List containing relationships of (mode . hydra).")

(defun shan--ide-add (mode hydra)
  "Add MODE and HYDRA as (mode . hydra) to `shan--ide-alist'."
  (push `(,mode . ,hydra) shan--ide-alist))

(defun shan--ide-resolve ()
  "Call a hydra related to active mode if found in `shan--ide-alist'."
  (interactive)
  (let ((hydra (alist-get major-mode shan--ide-alist)))
    (if hydra
        (funcall hydra)
      (message "IDE not found for %s" major-mode))))
   #+end_src

* Org

  Org is so colossal, it’s worth learning. Gets its own file, and one day I’ll get around to making this literate and
  clean.

** New Org

   #+begin_src emacs-lisp
(defconst shan--org-features '(org-macs org-compat ol ob-exp)
  "Features that may have been loaded by builtin Org but we want to use new Org's version.")
(defconst shan--reload-org-features-p (and (featurep 'org-macs) (s-contains? "usr" (feature-file 'org-macs)))
  "A bit hard-coded, but determines if we have to reload features due to builtin Org features being loaded.")

;; yeet built in Org path from load-path, so that a new Org path will definitely take precedence
(when-let (orglib (locate-library "org" nil load-path))
  (setq load-path (delete (substring (file-name-directory orglib) 0 -1)
                          load-path)))
(when shan--reload-org-features-p
  (dolist (org-feature shan--org-features)
    (and (featurep org-feature) (unload-feature org-feature t))))

(defun +org-fix-package-h (package &rest _)
  (when (equal package "org-mode")
    (let ((org-mode-dir (straight--repos-dir package)))
      (progn
        (message org-mode-dir)
        (apply 'f-mkdir (f-split org-mode-dir))
        (with-temp-file (expand-file-name "org-version.el" org-mode-dir)
          (insert "(fset 'org-release (lambda () \"9.4\"))\n"
                  "(fset 'org-git-version #'ignore)\n"
                  "(provide 'org-version)\n"))))))

(add-hook 'straight-use-package-pre-build-functions '+org-fix-package-h)

(use-package org
  :straight (org-mode
             :host github
             :repo "emacs-straight/org-mode"
             :files ("*.el" "lisp/*.el" "contrib/lisp/*.el")))

(straight-use-package '(org :local-repo nil))

(when shan--reload-org-features-p
  (dolist (org-feature shan--org-features)
    (require org-feature)))
   #+end_src

** TODO General Org

   #+begin_src emacs-lisp
(setq org-src-fontify-natively t
      org-src-window-setup 'current-window
      org-src-strip-leading-and-trailing-blank-lines t
      org-src-preserve-indentation t
      org-src-tab-acts-natively t
      org-pretty-entities t
      org-hide-emphasis-markers t
      org-support-shift-select t)
   #+end_src

** TODO Bullets

   This might be a bottle neck actually.

   #+begin_src emacs-lisp
(use-package toc-org
  :hook
  (org-mode . toc-org-enable))

(use-package org-bullets
  :hook
  (org-mode . org-bullets-mode)
  :config
  (setq org-bullets-bullet-list '("⁖"))
  (set-face-attribute 'org-level-1 nil
                      :height 1.25
                      :weight 'bold)
  (set-face-attribute 'org-level-2 nil
                      :height 1.1
                      :weight 'bold)
  (set-face-attribute 'org-level-3 nil
                      :height 1.0
                      :weight 'bold)
  (set-face-attribute 'org-level-4 nil
                      :height 1.0
                      :weight 'bold)

  (set-face-attribute 'org-ellipsis nil
                      :underline nil
                      :background "#fafafa"
                      :foreground "#a0a1a7"))
   #+end_src

* TODO Language Augmentation

* TODO Writing/ Documents

* TODO Hobbies

  Eventually I'll add more hobbies...

** Medical

   This requires =unidecode=. A rather edgy package, emacs hangs a lot.

   #+begin_src emacs-lisp
(use-package pubmed
  :commands (pubmed-search pubmed-advanced-search))
   #+end_src

* Community

  A lot of vanity

** TODO Browser

   Control how links and browser-url-generic function works (also for links).

   #+begin_src emacs-lisp
(setq browse-url-browser-function 'browse-url-generic)

(cond((executable-find "firefox") (setq browse-url-generic-args '("-private")
                                        browse-url-firefox-program "firefox"
                                        browse-url-generic-program "firefox"))
     ((executable-find "chromium") (setq browse-url-generic-args '("-incognito")
                                         browse-url-chromium-program "chromium"
                                         browse-url-generic-program "chromium"))
     ((executable-find "google-chrome") (setq browse-url-generic-args '("-incognito")
                                              browse-url-chrome-program "google-chrome"
                                              browse-url-generic-program "chrome")))
   #+end_src

** TODO SICP

   If I have the book, I've lost an excuse to not read it... hopefully. Might as well make this section TODO too...

   #+begin_src emacs-lisp
(use-package sicp)
   #+end_src

** Wakatime

   Monitor my coding activity. Remember to set =wakatime-api-key= in =personal/settings.el=.

   #+begin_src emacs-lisp
(use-package wakatime-mode
  :if (and (executable-find "wakatime") (boundp 'wakatime-api-key))
  :config
  (setq wakatime-cli-path (executable-find "wakatime"))
  (global-wakatime-mode))
   #+end_src

* TODO [#A] Miscellaneous Packages

  Just a salmagundi. Sooner or later, they'll find their places (or maybe their place here...).

  Problematic packages first, tangled off and commented.

  #+begin_src emacs-lisp :tangle off
;; (use-package docker
;;   :bind (("C-c d" . docker)))
;; (use-package docker-compose-mode)
;; (use-package docker-tramp
;;   :config (setq docker-tramp-use-names t)) ;; name vs id
;; (use-package undo-tree) ;; figure out toggle
;; (use-package pass)
;; (use-package pinentry)
;; (use-package edit-indirect)
;; (use-package tablist)
;; (use-package helpful)
;; (use-package direnv)
;; (use-package pyvenv)
;; (use-package writeroom-mode)
;; (use-package whitespace-cleanup-mode)
;; (use-package google-this)
;; (use-package my-utils)
;; (use-package recentf)
  #+end_src

  Now the misc packages

  #+begin_src emacs-lisp
;; (use-package speed-type)
;; (use-package origami)
;; (use-package demangle-mode)
;; (use-package academic-phrases)
;; (use-package powerthesaurus)
;; (use-package crontab-mode)
;; (use-package salt-mode)
;; (use-package rmsbolt)                   ; A compiler output viewer
  #+end_src
